 
/* 1. 
Відповідь:  

Перевірка: */
// console.log ()

/* 1.'number' + 3 + 3 . 
Відповідь: number33 
Конкатенація.Строка + додемо дві цифри.
Перевірка: */
// console.log ('number' + 3 + 3)

/* 2. null + 3. 
Відповідь:  3
Додавання. 3 + 0=3 (null перетворюеться на 0))
Перевірка: */
// console.log (null + 3)

/* 3. 5 && "qwerty"
Відповідь:  qwerty
Логічне І. Дна операнта true. Виводить останне true
Перевірка: */
// console.log (5 && "qwerty")

/* 4. +'40' + +'2' + "hillel";
Відповідь: 42hillel 
Унарний +. Спотчатку перетворює 40 і 2 на числа,  складає іх, а потім конкатенує зі строкою
Перевірка: */
// console.log (+'40' + +'2' + "hillel")

/* 5 '10' - 5 === 6. 
Відповідь: false 
=== Строгое равенство. Спочатку перевторю 10 на число, віднімає 10-5. 5 не парвно 6. ->false
Перевірка: */
// console.log ('10' - 5 === 6;)

/* 6. true + false
Відповідь: 1 
0+1=1
Перевірка: */
// console.log (true + false)

/* 7. '4px' - 3 
Відповідь:NaN  
Строка - число = не число
Перевірка: */
// console.log ('4px' - 3)

/* 8. '4' - 3 
Відповідь:1  
перевторює 4 на число, даіл 4-3
Перевірка: */
// console.log ('4' - 3)

/* 9. '6' + 3 ** 0
Відповідь:  61
Цікаве завдання. Прийшлось в чат GPT писати :). ** -возведение в степень 3 в степені 0 = 1. '6' - строка.  Далі йде конкатинаціяю. 
Перевірка: */
// console.log ('6' + 3 ** 0)


/* 10.  12 / '6'
Відповідь: 2
 Строка перетворюеться на число, далі поділ 12/6
Перевірка: */
// console.log (12 / '6')


console.log (12 / '6')

