 
/* 1. 
Відповідь:  

Перевірка: */
// console.log ()

/* 1.'number' + 3 + 3 . 
Відповідь: number33 
Конкатенація.Строка + додемо дві цифри.
Перевірка: */
// console.log ('number' + 3 + 3)

/* 2. null + 3. 
Відповідь:  3
Додавання. 3 + 0=3 (null перетворюеться на 0))
Перевірка: */
// console.log (null + 3)

/* 3. 5 && "qwerty"
Відповідь:  qwerty
Логічне І. Дна операнта true. Виводить останне true
Перевірка: */
// console.log (5 && "qwerty")

/* 4. +'40' + +'2' + "hillel";
Відповідь: 42hillel 
Унарний +. Спотчатку перетворює 40 і 2 на числа,  складає іх, а потім конкатенує зі строкою
Перевірка: */
// console.log (+'40' + +'2' + "hillel")

/* 5 '10' - 5 === 6. 
Відповідь: false 
=== Строгое равенство. Спочатку перевторю 10 на число, віднімає 10-5. 5 не парвно 6. ->false
Перевірка: */
// console.log ('10' - 5 === 6;)

/* 6. true + false
Відповідь: 1 
0+1=1
Перевірка: */
// console.log (true + false)

/* 7. '4px' - 3 
Відповідь:NaN  
Строка - число = не число
Перевірка: */
// console.log ('4px' - 3)

/* 8. '4' - 3 
Відповідь:1  
перевторює 4 на число, даіл 4-3
Перевірка: */
// console.log ('4' - 3)

/* 9. '6' + 3 ** 0
Відповідь:  61
Цікаве завдання. Прийшлось в чат GPT писати :). ** -возведение в степень 3 в степені 0 = 1. '6' - строка.  Далі йде конкатинаціяю. 
Перевірка: */
// console.log ('6' + 3 ** 0)


/* 10.  12 / '6'
Відповідь: 2
 Строка перетворюеться на число, далі поділ 12/6
Перевірка: */
// console.log (12 / '6')

/* 11. '10' + (5 === 6);
Відповідь:  10false
5 не строго равно 6 =false. Далее конкатенація.
Перевірка: */
// console.log ('10' + (5 === 6);)

/* 12. null == ''
Відповідь: false 
null  не равен пустой строке. Це значить false
Перевірка: */
// console.log ()

/* 13. 3 ** (9 / 3)
Відповідь:27
** - возведение в степень. сначала 9/3= 3. потім 3 в степені 3
Перевірка: */
// console.log (3 ** (9 / 3))

/* 14. !!'false' == !!'true'
Відповідь:true
!! -подвійне логічне отріцание. 'false' і 'true'- це строки. В булоіане , якщо строка не пустая, то це true.  
Далі перетвореня. true -> false->true. 
Далі порівняння true= true
Перевірка: */
// console.log (!!'false' == !!'true')

/* 15. 0 || '0' && 1
Відповідь:1
Оператор || - ілі.Повертає перше true
0- false. '0'- не пуста строка , повертає true. ТОму перша частина - '0'
Далі, оба операнта true. Оператор && І повертає останне true.
Перевірка: */
// console.log (0 || '0' && 1)

/* 16.  (+null == false) < 1;
Відповідь: false
+null перетворюеться в 0. 0 == false. Це  true. true=1. 1<1  це false    
Перевірка: */
// console.log ((+null == false) < 1;)

/* 17. false && true || true
Відповідь: true  
false && true - Опертор І. Якщо один оператор false, повертає false. 
false || true _Оператор ілі. Повертає перший true
Перевірка: */
// console.log (false && true || true)

/* 18.false && (false || true) 
Відповідь:  false
Спочатку дивимочь то що в кавичках. false || true - вибирає перший ture. 
false && true -Повертає пуршу false
Перевірка: */
// console.log (false && (false || true))

/* 19. (+null == false) < 1 ** 5
Відповідь:  false
Дивимось що в скобках. +null == false . +null це 0. 0== false. Це true. true-> 1. 
1 в степені 5= 1.
ТОму фінальний вид 1 < 1.  Це false
Перевірка: */
// console.log ((+null == false) < 1 ** 5)



