 
/* 1. 
Відповідь:  

Перевірка: */
// console.log ()

/* 1.'number' + 3 + 3 . 
Відповідь: number33 
Конкатенація.Строка + додемо дві цифри.
Перевірка: */
// console.log ('number' + 3 + 3)

/* 2. null + 3. 
Відповідь:  3
Додавання. 3 + 0=3 (null перетворюеться на 0))
Перевірка: */
// console.log (null + 3)

/* 3. 5 && "qwerty"
Відповідь:  qwerty
Логічне І. Дна операнта true. Виводить останне true
Перевірка: */
// console.log (5 && "qwerty")

/* 4. +'40' + +'2' + "hillel";
Відповідь: 42hillel 
Унарний +. Спотчатку перетворює 40 і 2 на числа,  складає іх, а потім конкатенує зі строкою
Перевірка: */
// console.log (+'40' + +'2' + "hillel")


/* 5 '10' - 5 === 6. 
Відповідь: false 
=== Строгое равенство. Спочатку перевторю 10 на число, віднімає 10-5. 5 не парвно 6. ->false
Перевірка: */
// console.log ('10' - 5 === 6;)

console.log ('10' - 5 === 6)

